"sézèv"
"trinidad
-
-aki
-an
-ba
-ou
-pau-
-syèk
0
18
1853
1878
18h
18h45
1920
1981
2010
28
4latannyé
8
</s>
<s>
<unk>
a
a'w
a'y
a-i
a-ou
a-w
a-y
aa
aaa
aba
abitiyé
abityèlman
abityé
abiyé
abo
abon
abîmes
accord
achté
actes
action
actions
adad
adan
adanadan
adans
adapté
adapté-y
adaptés
admettons
adopté-y
adoré
adoumanman
adyé
adélya
afrik
afrikèn
afè
agrikilti
agrikiltè
agrèr
aides
aimer
ajouté
aka
ako
aksantyé
aksèpté
aksé
aksépté
aktivité
aktyal
aktyèlman
alantou
alarètrèt
albè
ale
alentou
aliman
aller
alokasyon
aloss
alosse
alosss
alyansman
alè
alèkilé
alèz
alé
alélouya
alò
alòs
amisman
amizman
amizé
amoni
amoué
amé
amérendyen
an
an-mwen
anan
ananvlop
ananvè
anba
anbenn
ancien
and
andanjé
andidan
andwa
andèwò
andéwò
anfas
anfen
anfinaldikont
anfèt
angiya
anglofòn
anglophones
anglé
angrè
anivèsè
anka
ankaz
anki
anklav
anko
ankò
anlo
anlè
anlè-la
anman
anmèm
anmèwdé-w
ann
anni
anniversaire
ano
anon
anonsé
anparfèt
anpil
anpizé
anplis
anplwayé
anplwayé-la
anrajé
anri
anrichi
ansalézon
ansanm
ansomur
ansuit
ansyen
ansèt
ansémoman
ansòt
antan
antann
antig
antil
antillais
antiyèz
antouléka
antrè
antré
anvi
anvlop
apa
apar
aparamman
apati
apennsi
apiyé
apoué
aprann
aprè
après
aprèzan
apré
apré-
apréprè
aprésa
aprézan
apwé
apwézan
apéprè
apò
ara
arecaceae
arivé
arèsté
arété
asezonman
asi
asosyasyon
assi
asèzoné
asé
aséfyé
asérola
asézonman
atan
atandan
atann
atitid
atristé
atè
au
aussi
autour
autre
aux
avan
avansé
avec
avè
avèk
aw
awa
ay
ayay
ayen
ayisyen
ayiti
ayè
a’w
a’y
ba
ba-ou
ba-y
baamas
balan-la
balon
balè
ban
ban-nou
banalisation
bandé
banglen
banjo
bank
bann
bannann
bannzil
bannzil-la
baril
bas
bastè
bat
bata-zendyèn
bato
bato-la
batèm
baw
bay
bayè
baz
bazil
ba’y
bel
ben
bi
bibliotèk
bibliotèt
bien
bigin
bin
bitabita
bitasyon
biten
bitin
bityé
bizwen
blakbotòn
blan
blé
bo
boat
bobi
bokantaj-palé
bokanté
bokit
bokou
bon
bondyé
bonjou
bonmoun
bonne
bonnòm
botan
bouch
bouché
bouden
boug
bougenviyé
bougrès
boukit
boula
boulanger
boulèt
bourg
bourgeois
bout
boutiques
boutt
boutèy
bra
braké
bravo
bren
brilé
bwa
bwa-koubari
bwa-la
bwajolan
bwaré
bwen
bwitaj
bwè
byen
byendéfwa
byento
bè
bèbèl-jolivans
bèf
bèj
bèk
bèl
bèlbèbèl
bèsyo
bèt
bèwjèt
bélizgwatémala
bélétan
bò
bòdlanmè
bòdèl
bòdé
bòl-a-men
bòn
bòskaf
c
c'est
c'est-a
c'était
cadeaux
canabis
canada
canal
canne
caraibes
caraïbe
caraïbéen
carrière
case
cawo
cayenne
cd
cela
cendres
cent
certains
chabon
chaché
chadwon
chaj
chak
chakfwa
chalviré
chalè
chalèstòn
chanjé
channda
chanté
chanté-y
chapo
chapé
charles
chaspann
chat
chatobren
chatouyé
chauvinisme
chayé
chayé’y
chenil-la
chenn
chenn-lasa
chimen
chimen-la
chimiz
chiraj
chiré
chivè
chivé
chivé-la
chivé-lasa
chié
cho
chomaj
chonjé
chou
chouboulé
chouk
chouké
choz
chwazi
chè
chèche
chèchè
chèché
chèlchè
coloniales
colonisation
comme
comment
commin
commonwealth
compouanne
compte
con
continent
continuité
contre
conténances
convient
cornely
couillon
couple
couples
couter
couè
crêche
cuisine
cuisson
cul
culturelle
cyclone
còdonnier
côté
d'acteur
d'autre
d'autres
d'avoir
d'esprit
d'estaing
d'intruire
dabitid
dabò
dabòw
dada
dako
dan
danmyé
dannkit
dans
dansé
dansé-y
dantis
daprè
dapré
darivé
daré
david
davwa
dayè
de
demen
depi
des
desann
desklav
despò
despòtasyon
desà
deux
developpement
di
di'w
di-mwen
di-ou
di-w
di-y
di-yo
dialek
diaspora
diffé
différentes
difikilté
difisil
difé
diféran
digommier
dimanch
dirais
dire
direksyon
diri
dirijé
dirèksyon
dirèktris-lékòl-la
dirèktèman
dirèktéman
diré-y
dis
diskou
diskoupé
disparèt
distraksyon
distribiyé
dit
ditan
dite
divizé
diw
dizan
diznévè
dizuitan
dizè
djok
dlo
do
dola
dombré
dominik
dominiken
domisil
donbré
donc
donk
donké
doron
dot
dotmoun
dou
doubout
doudou
doulè
dousiné-kanpo
douslèt
douvan
douvanjou
douvant
douwé
douz
drapo
drivayè
drivé
drès
dréné
du
dur
dwa
dwèt
dwét
dwòg
dyédonné
dè
dè-w
dègné
dèkwa-la
dèmen
dènyè
dènyé
dènyé-la
dèpi
dèyè
dèyè’y
dèyé
dé
déba
débaké
débouya
débouya-lasa
débòdéman
découverte
dédu
dédé
défilé
dégajé
dégenn
dégizé
dégrenné
dégueulas
déja
déjà
déjéné
déjénéré
dékatyé
déklaré
dékonsantrasyon
dékouvè
dékouvèt
dékré
délenkan
délè
démografi
démontré
démélé
déotwa
dépa
dépalé
dépann
dépawfwa
dépendance
dépi
déplasé
dérivé
désandan
désann
désen
désidé
désirad
désè
désèwten
détaché
détui
détwa
développement
dévenn
déviré
dévlopman
dévlopé
déwò
déyès
dézan
dézirad
dézyèm
dézyèman
dézè
dòmi
dòt
e
effectivement
effectivemnt
egzanp
ekzakteman
ekzamp
ekzanp
ekzat
ekzisté
elayiz
emil
en
enben
enclave
encò
endépandan
enfants
enfeksyon
enfin
enfèt
enfòmasyon
enki
enkyèt
enmé
enpa
enprovizé
enpé
enpòtan
enpòté
ensidans
enstri
enstriman
ensuite
entre
entrisman
entrodui
entèl
entèltyél
entérésan
entérésé
envité
envitéw
es
esklav
eskè
eské
espliké
espré
espéryans
espéré
espésyalman
espòté
espòté-y
ess
est
est-il
et
euh
euro
ewopéyen
exactement
fab-la
faire
fait
fal
famille
familles
fanfoulich
fanm
fanm-bitasyon
fanme
fanmi
fanmi-zòtèy
fannm
farin
fason
fasèt
faut
favè
façon
fen
fenfon
fengnan
festif
festive
fey
fi
fianmizi
fidèlité
fier
fifi
figi
figue
fiks
fil
fils
filé
fim
fin
finalman
fini
fininalman
fisèl
fiy
fiyansay
fiyè
flanm
flora
florid
flè
flègèdènou
fléri
fo
fois
fon
fonksyon
fonmé
formation
forme
foséyè
foto
fou
foula
foumi
foumi1
four
fouré
fout
fouti
fouté
foutépamal
fouyé
france
francesca
frans
fransè
fransèz
fransé
fri
frijidè
frikasé
frizé
frui
fré-la
fréné
fur
fwa
fwan
fwansé
fwomajé
fwè
fwèt
fyè
fè
fè'w
fè-y
fèmé
fèmété
fès
fèt
fèy
fè’y
fé
fényan
fésé
fété
févriyé
fête
fêtes
fò
fòl
fòm
fòs
fòsé
fòséman
fòséw
fòwmé
gadé
gadé-mwen
gadé-y
galante
galba
gangann
gangné
ganm
ganm-la
ganmé
gare
gason
gason-anbaglaj
gato
gaté
gaté-y
gay
gaël
gdcf
genbo
gentihomme
gidonné
giscard
gita
giyann-la
gomon
gonflé
gou
goud
goumé
gouvènèman
gouvènéman
goyav
gra
grabyo
graisseries
graj
gran
gran-apa
grand
grande
grandes
grandi
grands
granmoun
grannonm
grannonm-la
gras
gratuitman
grenn
grigné
griy
griyo
griyé
griz
gro
group
grésé
guadeloupe
guadloupéen
guiyan
guy
guyan
gwada
gwadeloup
gwadloup
gwadloupÉyen
gwadloupéyen
gwadoup
gwatémala
gwo
gwoka
gwossi
gwoup
gwoup-la
gyaka
gyèl
gyòk
gèl
gèrié
gèy
gòj
gòl
ha
had
hak
hay
hello
henkenchyen
hercule
hispanophones
hou
hum
humaine
humhum
hélé-mwen
i
idantitÉ
idantité
idanté
idé
idée
ifo
ika
il
ilitizé
ils
imaj
in
indiens
indépendants
infections
inikman
inosan
intérêt
inè
irresponsable
isi
isidan
issu
istil
istorik
istwa
itilize-y
itilizé
itilizé-y
ivèr
j'ai
ja
jaden
jai
jakob
jakòb
jan
jan-maché
janbé
janmayik
janmé
jaélia
je
jen
jenn
jenne
jennjan
jessica
jet
jin
jis
jisak
jisk
jiska
jisko
jistan
jiston
jistéman
jod
jodi
jodijou
jodla
jolinèt
jou
jou-lasa
joudijou
jouer
jouné
jous
jouwé
justement
jwenn
jwé
jà
jèm
jèn
jé
jénéral
jénéralman
jénérasyon
jéografik
jérè
jéwòm
jòd-la
jòdijou
jòdla
jòne
k'an
k'ay
ka
ka'w
kabouya-la
kabrit
kabwa
kadans
kado
kadré-y
kadè
kagou
kajou
kaka
kakwè
kal
kalaja
kalipso
kalité
kalkilé
kan
kanalizé
kanaval
kanavalèks
kanklo
kanmem
kanmen
kanmèm
kann
kannal-la
kanpèch
kanta
kantik
kantil
kapab
kapasité
kapestè
kapital
kapsil
karant
karapat
karapat-la
karata3
karayib
karayib-ia
karayib-la
karibéyenn-la
karisti
karo-fè
karèm
karé
karésol
karésé
karésé-w
karésòl
karòt
kas
kasav
kasavri
kaskòd
kat
katégori
kaw
kawtyé-la
kay
kayi
kayou
kaz
ke
ken
kenbé
ki
kiba
kidonk
kifè
kijan
kikoté
kilibibi
kilinè
kilomèt
kilti
kiltirÈl
kiltirèl
kiltivé
kilè
kimbè-w
kimbé
kimoun
king
kisé
kitan
kitty
ki’y
klan
klassik
klima
klux
klè
ko
kochon
koko
kokozyé
kolombo
kolon
kolonaj
kolonbi
kolonbo
koloni
kolonyal
kolyé
kom
komantasyon
komin
komin-
komin-lasa
kominiké
kominotaris
komun
komunoté
komè-
kon
konba
konbat
konbyen
kondi
kondisyon
kondisyoné
konet
konfimé
konfyans
kongné
kongo
konkonm
konkonsa
konmansman
konmès
konngo
konnèt
konolyalis
konplètman
konplé
konpran
konprann
konpwann
konpwanndi
konpè
konpétiti-
konpétivité
konsa
konsi
konsidiré
konsidérasyon
konsidéré
konsomasyon
konsomé
konsomé-y
konstaté
konstitisyon
konstrui
konstwi
konsui
konsyans
konsèvé
konsèvé-y
konsèvéé
konséyé’y
kont
konti
kontinan
kontinyé
kontribann
kontrolé
kontrèman
kontré
kontèdmanti
kontèl
konté
konvwa
konvwa-la
konwa
konyenla
konyè
konyé
konèt
kostarika
kostim
kosyè
koton
koton-la
kott-soulvan
koté
kotésit
kou
kouché
koujèt
koulè
koulé
koumansé
koupé
kouran
kouri
kout
kouté
kouw
kouzen
kouzin
kouzyé
kra
kraché
kravat
krenkwennè
krentt
kri
krikett
kristòf
kritik
kriyé
kriyé-mwen
kriyé-y
krèm
krèp
krèy
kréyativé
kréyé
kréyòl
kréòl
ku
kui
kuit
kuizin
kuiziné
kultur
kwa
kwen
kwi
kwi-la
kwè
kyakya
kyolé
kyonkyon
kyé
kè
kèk
kès
kèsyon-lasa
ké
kéki
késtyon
kò
kòd
kòdé
kòk
kòk-genm
kòm
kòman
kòmè-
kòmèsyal
kòmèsé
kòwòsòl
k’ay
l
l'agent
l'air
l'amener
l'anmou
l'année
l'extérieur
l'histoire
l'historique
l'homme
l'inra
l'état
la
labastiy
labaz
labitid
labòn
labòwdèlèz
ladja
ladominik
ladézirad
lafan
lafanmi
lafen
lafimé
laflimé
lafrans
lafrik
laguadeloup
lagwadloup
lagwadloupéyèn
lagé
lagé-y
laide
laise
laissent
laj
lajan
lajouné
lajòl
lakanaval
lakanpay
lakat
lakaz
lakilti
lakontantman
lakrent
lalin
lalit
lalitérati
laliwonnaj
laliwonnaj-lasa
lalé
lamen
lanbi
lanbéli
landémen
lang
langaj
langoust
langues
lankan
lanm
lanmen
lanmou
lanmè
lanmèd
lanmès
lanméri
lanmérik
lanmò
lanné
lanprèsman
lansbètran
lansrokèt
lantiy
lantman
lantou
lantèman
lanvironman
lapansé
laparizyèn
laparèt
lapenn
lapenti
laplas
lapli
laplipa
lapolis
laprizon
lapèldéchanpyon
lari
larichès
larÈl
larèl
larézistanlarezistan
las
lasa
lasé
latannyé
latannyé4madanm-la
latravèsé
lavalyè-la
lavan
lavantaj
lavi
lavwa
lavé
lavéyé
le
lekstériyè
lekszitwa
len
lenbé
lend
lendi
lendistri
lenflyans
lenj
lenprézyon
lenstan
lentènèt
les
lesklavaj
lespòtasyon
lestomak
li
libanè-la
libèté
libéré
lidik
lidé
lidé-lasa
lil
lilèt
lilèt-la
limenm
limit
lis
lison
lisé
lité
livèr
lizin
lizyè
lo
lodè
lojé
lokans
lokasyon
lokazyon
lontan
lopilans
lot
lou
louragan
luil
lwa
lwen
lwil
lyanné
là
lè
lèd
lèren
lèsplikasyon
lèspri
lèstonmak
lèstravay
lèsé
lèwvwè
lé
léana
léfiji
léhou
lékilib
lékomès
lékouz
lékòl
lélanné
lématématik
lépok
lépòk
lérélasyon
lésent
lésott
lésé
lésé-y
léta
lété
lévolisyon
lévwa
lévwaz
lévé
lévé-y
léwop
léwoz
léwòz
lézanmi
lézòt
lò
lòd
lòdè-la
lòganizasyon
lòt
lòt-la
m
ma
macaque
machann
maché
madanm
madanm-la
madi
madras
madè
mafi
magré
main
mais
maison
maji
mak
makak
maké
maké’w
mal
malad
maladi
malcom
malè
malélivé
maléré
man
manch
mandé
mandé-i
mandé-mwen
mandé-nou
mandé-w
mandé’y
manfou
mangn
mangnòk
manjé
manjé-y
manké
manman
manman-y
manmbo
manni
manno
mannyè
mannyòk
mansousyan
mantal
manti
manyòk
manzè
mardi
mardigras
mari
marie-
marie-galantais
marie-galantaise
marie-galante
marie-galantè
marigalant
marigalantè
marigalentèz
marinad
maron
martin
maré
masalé
mask
maské
maskéw
maso
maten
matinik
matinikgwadloup
matiné
matière
matnik
matriyarkal
matyè
matété
mawon
may
mayé
mayémen
mayòk
mayòri
me
mem
memm
memsi
men
mendé
menm
menmditan
menmjan
menndé
menndéséou
mens
mentalité
mesaj
mesmin
mesure
metropol
metter
mhm
mi
michel
michelin
midi
mign
mil
milat
milflè
milyé
minit
miss
missié
misyé
mit
mitan
mizi-anmizi
mizik
mizè
mizé
mizérab
mizéreu
mo
moderne
modernisme
modes
modènité
mofwazé
moin
moins
moli
molière
moman
moman-la
moman-lasa
mon
monchè
mond
moniman
monpti
monsérat
montré
montserrat
monté
moralité
mori
morue
moso
motivé
mouchwè
moun
moun-bitasyon
moun-bitasyon-la
moun-dèwò
moun-la
mounfanm
mounla
mounsé
mounté
mouvman
mové
movétan
musique
mwa
mwayen
mwen
mwenmem
mwenmenm
myé
mè
mèg
mèkrédi
mèksik
mèm
mèmsi
mènasé-y
mèné
mèr-
mère
mès
mèsi
mèt
mèt-a-mangnòk
mèt-gason
mèwè
mèyè
mé
méchansté
méchè
médikaman
mékontantman
mékrédi
mélanj
mélanjé
mélon
mélé
ménage
méné
méné-y
méprizé
mérendyen
mérité
mésyé
mét
métier
mété
mété-y
mévèy
méyiken
méyiken-la
méyè
mézanmi
même
mò
mò-la
mòd
mòlòkòy
mòso
n'homme
nanbouk
nanpèch
nap
nasyon
natif
nature
natyon
naté
ne
neg
nenpòt
neskzitwa
ni
niau
nich
nikaragwa
nini
nirmal
nitali
nitout
nitrisyonèl
nité
niveau
nivo
niyès
no
nobèl
nom
non
nonm
nonm-konsa-pou-yé-lasa
nonm-la
nonm-obou-
nord
normalement
notab
notamman
nou
nou-y
nouri
nous
nous-mêmes
noutout
nouveaux
nouvo
nouvèl
nowèl
nuit
nwa
nwè
nwè-la
nwèl
nyès
nÈg
nèf
nèg
nèy
né
négosyé
négro
nésans
nésésè
nétwayé
nò
nòmal
nòmalman
nòwmal
o
obama
oben
oblijé
oblijé’y
obliyé
occasion
ogmanté
oh
okin
okontrè
oké
ola
olala
olyé
omwen
on
oncle
ondiras
onivo
onlo
onon
onoré
onsèl
ont
onzè
onèt
oo
opipirit-chantan
opwal
orgies
osi
oswè
ot
otan
otila
otomatikman
otonòm
ou
oubliyé
oubliyé-y
oublié
oubyen
ouverture
owa
où
p'on
pa
pa-asi
pace
padavwa
pakoté
pakèt
pal
pala
pale
palé
palé-w
pan
pandan
pangné
pani
pann
pannama
pannan
pannanma
pannyé
pannyòl
pansé
pantalon
panten
pap
papa
papa-y
papay
papa’y
papi
papiyòt
papyé
pap’an
par
paralèlman
parapolo
parapòt
parce
paris
paris8
parisyen
park
part
parèt
parèy
paré
pas
pasad
pascal
pasi
paskal
paskè
paské
pastèk
pasé
pasé’y
pat
pataj
patajé
patat
pati
patikilyè
patikilyé
patrimwan
pavané
pawtikilyé
pawòl
pawòl-lasa
pays
ped
pen
pengné
pensée
personnellement
petit
petite
peu
peut
peynier
photo
pi
pignon
pik
pikan
piké
pil
pilipo
pilo
pip
pipigné
pisimyé
pisin
piskè
piské
pistach
pistache
pisyèt
pit
piti
piti-bannzil
pitit
pitit-a-bondyé
pito
pla
place
placées
plaisi
plan
planté
plas
plat
play
plein
plen
plent
pli
plibiten
pliplis
plis
plisse
plito
pliyé
plizyè
plui
plupart
plus
plutot
pléré
plési
plézi
po
poban
poblèm
pointe
poko
polin
polis
polisyé
politik
politique
pon
ponch
ponmlé
ponmoun
popilasyon
populations
posib
posibilité
possibilité
potansyèl
poté
pou
pou-i
pou-y
pouki
poukwa
poukwapremyé
poul
poulè
poulèt
poupé
pour
pousa
pousuivasyon
pousé
poutan
poutourist
pouvoir
povrété
pozisyonné
pozé
pran
pran-y
pratikman
premyè
premyé
pren
pri
pripri
prizon
prizé
problèm
producteur
produi
produit
produits
profité
promèt
propozé-y
proprement
protéjé
prèmyé
près
prèsk
prèstans
prèstans-la
pré
préféré
prémyé
préparé
préparé-y
préparéw
présidan
présizé
prété-y
prévwa
prézan
prézans
prézanté
pròp
psychologie
puisans
puissance
punch
pur
pwa
pwa-di-bwa
pwan
pwason
pwayé
pwen
pwent
pwenti
pwèl
pwès
pwòp
pyès-bannann
pyès-bannann-la
pyès-fanm
pyèskann-la
pyé
pyé-la
pyébwa
pyété
pÉyi
pè
pèd
pèmèt
pèp
pèsi
pèsonèlman
pèsouvwè
pèsé
pèwsonaj
pé
péchè
péché
pélé-lanmou
périod
pétrol
pétèt
pétét
péyi
péyi-la
péyi-lasa
péyé
péyé-y
pò
pòch
pòm
pòst
pòt
pòter
pòtoriko
pòtré
pòté
pòté’y
p’on
qu'a
qu'est
qualité
que
quel
quelle
qui
quoi
rakonté-w
rakoun
ranjé
rankontré
ranmé
rann
rann-li
rann-mwen
ranpli
rantré
rapidman
raport
rapport
rapò
rasazié
rasist
ratt
ravin-la
rawman
rebelòt
recherche
reconnaissance
reconnu
reine
rekonséyé
ren
renne
rentes
reprann
repren-y
respiré
responsab
respè
respékté
retou
retrouvé
reviré
reztan
rhumes
ri
rich
richplèn
richès
rio
ritm
rityé
rité
river
rivyè
rivé
rivé-mwen
rivé-yo
ronkontré
rosa
rouj
rousi
rsa
rythmes
rèd
rèlasyon
rèligieuz
rèlijyon
rèmakab
rèpasé
rèpwoché’y
rès-
rèspè
rèspèté’y
rèsté
rèviré
réaji
récho
réchèché
rédistribiyé
réfléchi
réflété
référans
réfòm
réglé
régléments
réjyon
rékoni
rékonèt
rékonésans
rékòlté
répité
répondè
réponn
réponne
répèrkité-y
répété
résaman
résisté
résous
résté
résèt
résèvé
rétouné
rétèni
rété
révandiké
réviré
révolisyion
révolisyon
réyinyon
réyisi
rézilta
rézisté
rézon
s
sa
sab
sajès
sak
saksofòn
sal
salvadò
salé
salézon
sam
samdi
san
san-
san-la
sanblaj
sanblanni
sanblé
sanglé
sanm
sann
sans
sans-
sans-lasa
sanséman
santi
santiw
santralkarayib
santé
sapoti
sasa
sav
savann
save
savoir
savé
scientifiquement
scolaire
se
sek
sela
senbat
senbioz
sendomeng
senk
senkan
senkant
senkè
senmawten
senné
senp
sent
sentann
senten
senti
sentimantal
sentkwa
sentèn
sept
sesi
sexuelle
sexuelles
si
sibi
sicrée
sid
sifi
signification
sijè
sik
sikdòj
siklòn
siklòn-la
sikré
sila
silon
similak
simplement
simulacres
simé
sin
sino
sipoté
siprimé-y
sipé
siren
siriyen-la
sis
sisi
sispann
sistèm
sistématikman
sisé
sitiyasyon
sitou
situation
sitwayen
sityasyon
sitèlman
siv
sivil
sivilizasyon
siwvwè
sizer
sizè
ski
sklérozé
skérosé
société
sodòm
sof
soirées
sojé
sol
solid
solida
solidarité
solisyon
solisyonné
solution
solèy
son
sonjé
sonmèy
sonné
sorte
sos
sosolida
sosyal
sosyété
sosyété-la
sou
soubarou
soubarou-la
souch
souf
soufwans
soukwé
soulajman
soulyé
sounon
soup
soupen
sous
soutou
soutyenn
souvan
souvantfwa
souveni
souvéni
souè
sponsorizé
sport
sportif
sportifs
spèktak
spécifique
ss
station
stratéjik
string
subsisté
sucre
suit
suiv
sujet
surtout
swa
swaré
swasant
swèf
swé
syal
syans
syantifik
syèk
syèl
syèl-la
sÉ
sè
sèk
sèksyon
sèl
sèlman
sèn
sèt
sètadi
sèten
sètèn
sèvi
sèvi-yo
sèwkèy
sèy
sèz
sé
sé'y
sé-y
séchress
séché
sél
séla
séparé
sériz
séré
sérémoni
sérémoni-lasa
sézon
séé
sòlèy-la
sòs
sòt
sòti
t'ai
ta
ta-ou
ta-w
tabak
taktak
tala
talè
tamprissouplé
tan
tan-lasa
tanbou
tanboudibrèz
tandis
tann
tann-yo
tanngo
tante
tanté
tap
taza
taïna
ta’y
tchou
tchouyé
temps
ten
tenne
terre
territoriale
théâtre
ti
ti-manman
tibo
tibou
tibwen
tifi
tikrikett
tikrikèt
tima
timafi
timoun
timoun-la
tini
tinyé
tipawol
tipawòl
tipla
tipyébwa
tit
tit-lasa
tizonné-yo
tobago"
tombé
tonik
tou
tou-lasa
touché
touf
toujis
toujou
toujours
toulongalé
touloulou
toulédé
touléjou
toumblak
touné
toupannan
toupatou
toupiti
toupré
tourist
tous
tousa
tousèl
tout
toutalè
toute
toutes
toutmoun
toutt
toutwèl
touvé
touvé'y
traces
tradisyon
tralala
tranblanntè
trankil
trankilité
trans
transfòmasyon
transfòmé
transmèt
trant
trapé
travail
travay
travayè
travo
travèsé
tren
trenné
trent
trente
tribi
tribiché
tribinal
trimé
tro
trodui
trouvé
trouvé-y
trwa
trè
très
trèzan
tréné
tu
turbulenscene
ture
tué
twa
twazyèm
twazé
two
twonbòn
twopikal
twèl
twòp
tyen
tè
tèks
tèl
tèlman
tèm
tèren
tèt
tèt-
té
tékla
téknolojik
télé
témwen
tépou
térèz
téré
tété
téyat
tòch
ue
uit
uitan
ultra-marain
un
une
untel
vach
valiwa
valiz
valorisé
valorizé
valè
vann
vanniy
vansé
vant
vaval
ven
venn
vennsenk
veut
veux
vi
vidé
vie
vin
vine
vini
viré
vis
vit
vitamin
vitman-présé
vité
viv
vivasyon
vivre
vizavi
vizit
vizou
vièj
vlé
voilà
vois
volkan
volé
vou
voukoum
voumtak
vraiment
vrè
vrèman
vré
vréman
vwala
vwayajé
vwazinaj
vwazinaj-la
vwè
vwè'w
vwè-y
vwèkòm
vwèvwè
vyann
vyolans
vyé
vyéfò
vyékò
vè
vèrden
vès
vé
véjétal
vénéré
vénézyéla
véyé
vòlkan
w
wa
wacha
wap
wari
wi
wikenn
wokinwòlmwen
woma
won
wonm
wop
woté
wouj
wouklé
woulouanjé’y
woulé
wouparèt
woupran
woutouné
wouvin
wouvè
woy
wè
wènon
wòb-a-kò
wòb-di-chanm
wòch
wòl
wòz
x
y
ya
yen
yenki
yo
yo-menm
yochak
yonn
yonou
yotout
youniti
yè
yé
z'abymes
zabwiko
zaffai
zafè
zan
zanana
zanmi
zannanan
zanno
zansyen
zansèt
zantiy
zantray
zataché
zeb
zendyen
zenk
zil
zil-
ziyanm
zié
zoji
zoranj
zot
zouté
zyé
zèb
zèl
zéfé
zéklav
zéklè
zépis
zépon
zépòl
zéro
zétazini
zétwal
zévan
zòn
zòt
zòtout
Ça
Ès
Èvè
É
Émil
à
à-i
ça
è
èché
èmé
ès
èspès
èstèbèkwè
ètnik
ève-w
èvè
èvè-i
èvè-w
èvè-y
é
ében
édikasyon
édikatif
édiké
édé'w
édé-y
éfasé
éfektiman
éfektivman
éfèktivman
éfèvèsans
éfèvésans
éféktivman
égoistéman
égzisté
éi
ékitab
ékonomi
ékonomik
ékta
ékzanp
ékzisté
élvé
élwanyé
émé
éoubyen
épi
épis
épok
épé
éro
érésman
ésa
éspès
éséyé
éta
étalman
étapes
étazini
étid
étrangère
étranj
étud
été
étéroklit
évakyé
évidamman
évité
évoliyé
évolyé
évè
éwopéyèn
éé
être
îles
ò
òdinatè
òganizé
òksèvasyon
òktòb
–
‘w
‘y
